#   4. 写程序,输入一个整数代表正方形的宽和高,打印如下的正方形:
#     如:
#       请输入宽度: 5
#     打印正方形如下:
#       1 2 3 4 5
#       2 3 4 5 6
#       3 4 5 6 7
#       4 5 6 7 8
#       5 6 7 8 9
#     如:
#       请输入宽度: 4
#     打印正方形如下:
#       1 2 3 4
#       2 3 4 5
#       3 4 5 6
#       4 5 6 7

w = int(input("请输入宽度: "))

line = 1
while line <= w:
    # print("这是第", line, '行')
    # 以line为开始打印w个数,打印在一行内
    i = line # 起始值是行号
    while i < line + w:
        print("%02d" % i, end=' ')
        i += 1
    print() # 换行

    line += 1

