# 2. 任意输入多个学生的姓名,年龄,成绩,每个学生信息存入一个字典中,然后再放入列表中(每个学生信息需要手动输入)
# 如:
#     请输入姓名: tarena
#     请输入年龄: 15
#     请输入成绩: 99
#     请输入姓名: name2
#     请输入年龄: 22
#     请输入成绩: 100
#     请输入姓名: <直接回车结束输入>
# 在程序内部生成如下列表:
# L = [{'name': tarena, 'age':15, 'score': 99}, {'name': name2, 'age':22, 'score': 100}]
# 1) 打印出上述列表
# 2) 以下列表格的形式打印出上述信息
# +---------------+-----------+----------+
# |     name      |    age    |  score   |
# +---------------+-----------+----------+
# |    tarena     |    15     |    99    |
# |     name2     |    22     |   100    |
# +---------------+-----------+----------+

L = []  # 创建一个列表,准备用来保存学生信息的字典

# 循环输入学生姓名,年龄,成绩,姓名为空结束输入
while True:
    n = input("请输入姓名: ")
    if not n:  # 姓名为空结束输入
        break
    a = int(input("请输入年龄: "))
    s = int(input("请输入成绩: "))
    # 得到的数据形成字典,
    d = {}  # 创建一个字典
    d['name'] = n
    d['age'] = a
    d['score'] = s
    # 加到列表内
    L.append(d)

print(L)
print("+---------------+-----------+----------+")
print("|     name      |    age    |  score   |")
print("+---------------+-----------+----------+")

for d in L:  # d绑定的是字典
    line = '|' + d['name'].center(15)
    line += '|' + str(d['age']).center(11)
    line += '|' + str(d['score']).center(10)
    line += '|'
    print(line)

# print("|    tarena     |    15     |    99    |")
# print("|     name2     |    22     |   100    |")
print("+---------------+-----------+----------+")
